In [1]:
# Elementlarni tanlash Series
import pandas as pd
import numpy as np

In [2]:
data= {'Yil':[2021,2020,2019,2018,2017,2016,2015,2010],
       'Aholi soni':[33.9,33.5,32.9,32.5, 31.9, 31.4, 30.9, 28.5],
       'Temp':[1.54, 1.48, 1.56, 1.62, 1.65, 1.66, 1.64, 1.53],
       'Zichlik':[79.77, 78.68, 77.53, 76.34, 75.13, 73.91, 72.71, 67.03]}
df = pd.DataFrame(data)
df

    Yil  Aholi soni  Temp  Zichlik
0  2021        33.9  1.54    79.77
1  2020        33.5  1.48    78.68
2  2019        32.9  1.56    77.53
3  2018        32.5  1.62    76.34
4  2017        31.9  1.65    75.13
5  2016        31.4  1.66    73.91
6  2015        30.9  1.64    72.71
7  2010        28.5  1.53    67.03

In [3]:
df.index=[21,20,19,18,17,16,15,10]
df

     Yil  Aholi soni  Temp  Zichlik
21  2021        33.9  1.54    79.77
20  2020        33.5  1.48    78.68
19  2019        32.9  1.56    77.53
18  2018        32.5  1.62    76.34
17  2017        31.9  1.65    75.13
16  2016        31.4  1.66    73.91
15  2015        30.9  1.64    72.71
10  2010        28.5  1.53    67.03

In [14]:
df

     Yil  Aholi soni  Temp  Zichlik
21  2021        33.9  1.54    79.77
20  2020        33.5  1.48    78.68
19  2019        32.9  1.56    77.53
18  2018        32.5  1.62    76.34
17  2017        31.9  1.65    75.13
16  2016        31.4  1.66    73.91
15  2015        30.9  1.64    72.71
10  2010        28.5  1.53    67.03

In [16]:
data = df['Aholi soni']

In [18]:
data

21    33.9
20    33.5
19    32.9
18    32.5
17    31.9
16    31.4
15    30.9
10    28.5
Name: Aholi soni, dtype: float64

In [20]:
data1= df[['Aholi soni']]
data1

    Aholi soni
21        33.9
20        33.5
19        32.9
18        32.5
17        31.9
16        31.4
15        30.9
10        28.5

In [22]:
type(data)

pandas.core.series.Series

In [24]:
a=data[21]

In [26]:
b=data[[21]]

In [28]:
type(a)

numpy.float64

In [30]:
type(b)

pandas.core.series.Series

In [32]:
data[0:4]

21    33.9
20    33.5
19    32.9
18    32.5
Name: Aholi soni, dtype: float64

In [34]:
data[[21,20,19,18]]

21    33.9
20    33.5
19    32.9
18    32.5
Name: Aholi soni, dtype: float64

In [36]:
obj=pd.Series(np.arange(8.),index=['a','b','c','d','e','f','g','h'])

In [38]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
g    6.0
h    7.0
dtype: float64

In [39]:
obj['a']

0.0

In [40]:
obj[['a']]

a    0.0
dtype: float64

In [41]:
obj[0:4]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [42]:
obj['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [48]:
obj['b':'h']

b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
g    6.0
h    7.0
dtype: float64

In [50]:
obj[['a','g']]

a    0.0
g    6.0
dtype: float64

In [52]:
obj['a':'c']=15
obj

a    15.0
b    15.0
c    15.0
d     3.0
e     4.0
f     5.0
g     6.0
h     7.0
dtype: float64

In [54]:
obj[obj<15]

d    3.0
e    4.0
f    5.0
g    6.0
h    7.0
dtype: float64

In [56]:
obj[obj==15]

a    15.0
b    15.0
c    15.0
dtype: float64

In [58]:
obj[obj>7]

a    15.0
b    15.0
c    15.0
dtype: float64

In [60]:
uz={2020:33.5,2019:32.9,2018:32.5,2017:31.9,2016:31.4,2015:30.9}
kz={2020:18.8,2019:18.5,2018:18.3,2017:18.1,2016:17.8,2015:17.6}
tj={2020:9.5,2019:9.3,2018:6.3,2017:8.9,2016:8.7,2015:8.5}
kg={2020:6.5,2019:6.4,2018:6.3,2017:6.2,2016:6.1,2015:6.0}
tr={2020:6.0,2019:5.9,2018:5.9,2017:5.8,2016:5.6,2015:5.6}

In [62]:
df=pd.DataFrame({'Uzbekistan':uz,
                'Kazakhstan':kz,
                'Tajikistan':tj,
                'Kirgizistan':kg,
                'Turkmenistan':tr})

In [64]:
df

      Uzbekistan  Kazakhstan  Tajikistan  Kirgizistan  Turkmenistan
2020        33.5        18.8         9.5          6.5           6.0
2019        32.9        18.5         9.3          6.4           5.9
2018        32.5        18.3         6.3          6.3           5.9
2017        31.9        18.1         8.9          6.2           5.8
2016        31.4        17.8         8.7          6.1           5.6
2015        30.9        17.6         8.5          6.0           5.6

In [66]:
df.T

              2020  2019  2018  2017  2016  2015
Uzbekistan    33.5  32.9  32.5  31.9  31.4  30.9
Kazakhstan    18.8  18.5  18.3  18.1  17.8  17.6
Tajikistan     9.5   9.3   6.3   8.9   8.7   8.5
Kirgizistan    6.5   6.4   6.3   6.2   6.1   6.0
Turkmenistan   6.0   5.9   5.9   5.8   5.6   5.6

In [68]:
df['Uzbekistan']

2020    33.5
2019    32.9
2018    32.5
2017    31.9
2016    31.4
2015    30.9
Name: Uzbekistan, dtype: float64

In [70]:
df[['Uzbekistan']]

      Uzbekistan
2020        33.5
2019        32.9
2018        32.5
2017        31.9
2016        31.4
2015        30.9

In [72]:
df['Uzbekistan'].to_numpy()

array([33.5, 32.9, 32.5, 31.9, 31.4, 30.9])

In [74]:
df[['Uzbekistan']].to_numpy()

array([[33.5],
       [32.9],
       [32.5],
       [31.9],
       [31.4],
       [30.9]])

In [76]:
df[['Uzbekistan','Turkmenistan']]

      Uzbekistan  Turkmenistan
2020        33.5           6.0
2019        32.9           5.9
2018        32.5           5.9
2017        31.9           5.8
2016        31.4           5.6
2015        30.9           5.6

In [78]:
df[3:]

      Uzbekistan  Kazakhstan  Tajikistan  Kirgizistan  Turkmenistan
2017        31.9        18.1         8.9          6.2           5.8
2016        31.4        17.8         8.7          6.1           5.6
2015        30.9        17.6         8.5          6.0           5.6

In [80]:
df>10

      Uzbekistan  Kazakhstan  Tajikistan  Kirgizistan  Turkmenistan
2020        True        True       False        False         False
2019        True        True       False        False         False
2018        True        True       False        False         False
2017        True        True       False        False         False
2016        True        True       False        False         False
2015        True        True       False        False         False

In [82]:
df[['Uzbekistan']][df['Uzbekistan']>32]

      Uzbekistan
2020        33.5
2019        32.9
2018        32.5

In [84]:
dfuz=df[['Uzbekistan']]

In [86]:
dfuz

      Uzbekistan
2020        33.5
2019        32.9
2018        32.5
2017        31.9
2016        31.4
2015        30.9

In [91]:
dfuz[dfuz['Uzbekistan']>32]

      Uzbekistan
2020        33.5
2019        32.9
2018        32.5

In [93]:
df2=df.T

In [95]:
df2

              2020  2019  2018  2017  2016  2015
Uzbekistan    33.5  32.9  32.5  31.9  31.4  30.9
Kazakhstan    18.8  18.5  18.3  18.1  17.8  17.6
Tajikistan     9.5   9.3   6.3   8.9   8.7   8.5
Kirgizistan    6.5   6.4   6.3   6.2   6.1   6.0
Turkmenistan   6.0   5.9   5.9   5.8   5.6   5.6

In [97]:
df3=df.transpose(copy=True)

In [99]:
df3

              2020  2019  2018  2017  2016  2015
Uzbekistan    33.5  32.9  32.5  31.9  31.4  30.9
Kazakhstan    18.8  18.5  18.3  18.1  17.8  17.6
Tajikistan     9.5   9.3   6.3   8.9   8.7   8.5
Kirgizistan    6.5   6.4   6.3   6.2   6.1   6.0
Turkmenistan   6.0   5.9   5.9   5.8   5.6   5.6

In [101]:
df2[df2[2019]>9]

            2020  2019  2018  2017  2016  2015
Uzbekistan  33.5  32.9  32.5  31.9  31.4  30.9
Kazakhstan  18.8  18.5  18.3  18.1  17.8  17.6
Tajikistan   9.5   9.3   6.3   8.9   8.7   8.5

In [103]:
df2[df2[2015]<8]

              2020  2019  2018  2017  2016  2015
Kirgizistan    6.5   6.4   6.3   6.2   6.1   6.0
Turkmenistan   6.0   5.9   5.9   5.8   5.6   5.6

In [109]:
# .loc/.iloc va .at/.iat

In [113]:
df

      Uzbekistan  Kazakhstan  Tajikistan  Kirgizistan  Turkmenistan
2020        33.5        18.8         9.5          6.5           6.0
2019        32.9        18.5         9.3          6.4           5.9
2018        32.5        18.3         6.3          6.3           5.9
2017        31.9        18.1         8.9          6.2           5.8
2016        31.4        17.8         8.7          6.1           5.6
2015        30.9        17.6         8.5          6.0           5.6

In [115]:
df.loc[[2015]]

      Uzbekistan  Kazakhstan  Tajikistan  Kirgizistan  Turkmenistan
2015        30.9        17.6         8.5          6.0           5.6

In [119]:
df.loc[[2019,2020]]

      Uzbekistan  Kazakhstan  Tajikistan  Kirgizistan  Turkmenistan
2019        32.9        18.5         9.3          6.4           5.9
2020        33.5        18.8         9.5          6.5           6.0

In [123]:
df.loc[[2019,2020],['Uzbekistan','Kazakhstan']]

      Uzbekistan  Kazakhstan
2019        32.9        18.5
2020        33.5        18.8

In [125]:
df.iloc[0,4]

6.0

In [133]:
df.iloc[[0,4],[0,3]]

      Uzbekistan  Kirgizistan
2020        33.5          6.5
2016        31.4          6.1

In [135]:
df.iloc[[0],[0,3,4]]

      Uzbekistan  Kirgizistan  Turkmenistan
2020        33.5          6.5           6.0

In [137]:
df.loc[:2017,'Uzbekistan']

2020    33.5
2019    32.9
2018    32.5
2017    31.9
Name: Uzbekistan, dtype: float64

In [139]:
df.at[2015,'Turkmenistan']

30.9

In [147]:
df.at[2020,'Uzbekistan']-df.at[2017,'Uzbekistan']

1.6000000000000014

In [149]:
df.iat[0,0]

33.5

In [151]:
nums=list(range(10,21))

In [153]:
nums

[10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [155]:
nums[0]

10

In [157]:
obj=pd.Series(np.arange(10.))
obj

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [167]:
obj[0]

0.0

In [159]:
obj.iloc[-1]

9.0

In [163]:
ser=pd.Series(np.arange(5.),index=['a','b','c','d','e'])

In [165]:
ser

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [169]:
ser[0]

C:\Users\user\AppData\Local\Temp\ipykernel_13580\2519058933.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0]

0.0

In [171]:
ser[-1]

C:\Users\user\AppData\Local\Temp\ipykernel_13580\3387420178.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[-1]

4.0